app/controllers/admin/posts_controller.rb

  def create
    @post = Post.new(post_params)

    if @post.save
---
INSERT INTO "posts" ("content", "created_at", "is_published", "slug", "title", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["content", "test"], ["created_at", Tue, 11 Mar 2014 22:03:15 UTC +00:00], ["is_published", true], ["slug", "new post"], ["title", "Test"], ["updated_at", Tue, 11 Mar 2014 22:03:15 UTC +00:00]]

  def update
    @post = Post.find(params[:id])

    if @post.update_attributes(post_params)
---
SELECT "posts".* FROM "posts" WHERE "posts"."id" = $1 LIMIT 1  [["id", "1"]]
UPDATE "posts" SET "title" = $1, "slug" = $2, "updated_at" = $3 WHERE "posts"."id" = 1  [["title", "Testingsfgsdf"], ["slug", "new-post"], ["updated_at", Tue, 11 Mar 2014 22:16:14 UTC +00:00]]